[
  {
    "id": 1,
    "createdOn": "2025/08/05, 16:26:57",
    "policyNumber": "RTYG4398RW0EI",
    "callSystem": "AWS Connect",
    "callType": "Complaints",
    "Selectedcategory": "Funeral Complaints",
    "selectedSubCategory": "Funeral Complaints",
    "dateTime": "2025/08/05, 00:15:00",
    "dateTimeEnd": "2025/08/05, 04:00:00",
    "secondCall": "YES",
    "additionalCall": "ER5D6FWGITJF",
    "AgentName": "NTSAKO",
    "riskOfficer": "KGOETE",
    "teamLeader": "PONTSHO",
    "callDuration": "10",
    "status": "Not Started",
    "FindingRegulatory": [
      {
        "phrase": "This call is being monitored and recorded for record-keeping, quality-assurance and security purposes. A copy of this call can be made available to you at your request. Do you understand and confirm that you are comfortable with this?\r\n",
        "category": "RICA",
        "compliance": "No",
        "comment": "VUYBI",
        "status": "In Progress"
      }
    ],
    "FindingMarket": [
      {
        "phrase": "Requested clear and accurate information relating to the query/Providing alternative solutions when applicable?\r\n",
        "category": "Product Information",
        "compliance": "No",
        "comment": "FTYUGIJ",
        "status": "Completed"
      },
      {
        "phrase": "Did the consultant update accurate notes for record keeping?\r\n",
        "category": "Record Keeping",
        "compliance": "No",
        "comment": "TFYUGIJOK",
        "status": "Not Started"
      }
    ],
    "FindingProduct": [],
    "FindingProcess": [],
    "FindingCustomer": []
  },
  {
    "id": 2,
    "createdOn": "2025/08/07, 11:05:22",
    "policyNumber": "EWRTYU",
    "callSystem": "AWS Connect",
    "callType": "Complaints",
    "Selectedcategory": "Funeral Complaints",
    "selectedSubCategory": "Funeral Complaints",
    "dateTime": "2025/08/07, 00:20:00",
    "dateTimeEnd": "2025/08/07, 06:00:00",
    "secondCall": "YES",
    "additionalCall": "RXETCYU",
    "AgentName": "RTYUH",
    "riskOfficer": "RTGYH",
    "teamLeader": "5DRFTYGU",
    "callDuration": "10",
    "FindingRegulatory": [
      {
        "phrase": "This call is being monitored and recorded for record-keeping, quality-assurance and security purposes. A copy of this call can be made available to you at your request. Do you understand and confirm that you are comfortable with this?\r\n",
        "category": "RICA",
        "compliance": "No",
        "comment": "",
        "status": "In Progress"
      },
      {
        "phrase": "To ensure that I am speaking to the right person and to protect the security of your information. I will ask you a few questions (NB: questions noted under process)\r\n",
        "category": "POPI",
        "compliance": "No",
        "comment": "",
        "status": "Not Started"
      }
    ],
    "FindingMarket": [
      {
        "phrase": "Advised the customer how he/she will receive feedback to their query\r\n",
        "category": "Call & feedback to Customer",
        "compliance": "No",
        "comment": "",
        "status": "Not Started"
      },
      {
        "phrase": "Correct and accurate information must be provided to the customer\r\n",
        "category": "Call & feedback to Customer",
        "compliance": "No",
        "comment": "",
        "status": "Not Started"
      },
      {
        "phrase": "Requested clear and accurate information relating to the query/Providing alternative solutions when applicable?\r\n",
        "category": "Product Information",
        "compliance": "No",
        "comment": "",
        "status": "Not Started"
      },
      {
        "phrase": "Pace of the call appropriate [did not sound rushed]?\r\n",
        "category": "Pace of the call ",
        "compliance": "No",
        "comment": "",
        "status": "Not Started"
      },
      {
        "phrase": "Did the consultant acknowledge language barrier?\r\n",
        "category": "Language barrier",
        "compliance": "No",
        "comment": "",
        "status": "Not Started"
      }
    ],
    "FindingProduct": [],
    "FindingProcess": [
      {
        "phrase": "Do you have an email address",
        "category": "Authentication",
        "compliance": "No",
        "comment": "",
        "status": "Not Started"
      },
      {
        "phrase": "Provides an explanation on the policy wording if required, when upholding a rejection",
        "category": "Authentication",
        "compliance": "No",
        "comment": "",
        "status": "Not Started"
      }
    ],
    "FindingCustomer": []
  },
  {
    "id": 3,
    "createdOn": "2025/08/12, 14:23:54",
    "policyNumber": "Ptyhjknlm",
    "callSystem": "AWS Connect",
    "callType": "Complaints",
    "Selectedcategory": "Stansure Complaints",
    "selectedSubCategory": "Stansure Complaints",
    "dateTime": "2025/08/12, 00:05:00",
    "dateTimeEnd": "2025/08/29, 00:35:00",
    "secondCall": "YES",
    "additionalCall": "4rt5yu67ti8",
    "AgentName": "Thabo",
    "riskOfficer": "Justin",
    "teamLeader": "Tumi",
    "callDuration": "10",
    "FindingRegulatory": [
      {
        "phrase": "Is it an appropriate/convenient time to talk?\r\n",
        "category": "Convenience /Outbound",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "Tshepo, Seotimeng"
      }
    ],
    "FindingMarket": [
      {
        "phrase": "Apologise when issue cannot be resolved on the current call and clearly outline next steps for the customer to take\r\n",
        "category": "Complaints Resolution",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "Thabo"
      }
    ],
    "FindingProduct": [],
    "FindingProcess": [],
    "FindingCustomer": [
      {
        "phrase": "Listens attentively ",
        "category": "Listens attentively ",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "Thabo"
      }
    ]
  },
  {
    "id": 4,
    "createdOn": "2025/09/16, 09:49:06",
    "policyNumber": "234567uio",
    "callSystem": "Nice Call",
    "callType": "Sales",
    "Selectedcategory": "Flexi Life Sales",
    "selectedSubCategory": "Flexi Life Sales",
    "dateTime": "2025/09/01, 00:00:00",
    "dateTimeEnd": "2025/09/16, 00:25:00",
    "secondCall": "YES",
    "additionalCall": "234ERTYHNJ",
    "AgentName": "NTSAKO",
    "riskOfficer": "ROMEO",
    "teamLeader": "NTSAKO",
    "callDuration": "5",
    "FindingRegulatory": [
      {
        "phrase": "Please note that I am an employee of SBIB who is mandated by Liberty Group Limited to sell this product and I am a fully qualified representative. and SBIB accepts the responsibility for the intermediary services rendered by me. SBIB is an authorised financial services provider. This product is regarded as Long-Term Category B and SBIB is authorised for this category. SBIB has a written mandate to act on behalf of Liberty and has professional indemnity and fidelity insurance cover in place. I need to inform you that I am calling you from Standard Bank Insurance Brokers, also known as SBIB (our FSP number is 224) and I am authorised in terms of a written mandate to render intermediary services for SBIB. Please note that I am an employee of SBIB who is mandated by Liberty Group Limited to sell this product and I offer financial services under supervision. and SBIB accepts responsibility for any intermediary services rendered by me. ",
        "category": "FAIS",
        "compliance": "No",
        "comment": "",
        "status": "Completed",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "As part of our service, Standard Bank of South Africa Limited would like to provide you with information on products and services offered by the group and other companies, which we believe may benefit you. Because we regard your personal information as confidential, we need your consent to share it with the group. The group means our affiliates, associates, subsidiaries and divisions together with our holding company.",
        "category": "Marketing Script",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "Liberty does not guarantee premium rates and reviews them at least once each year.  \r\nMr/Mrs XXX, for the debit order to come off your Standard Bank account please confirm the last four digits of your account number with me?      \r\nNB: The agent must not give the last four digits of the bank account to the customer – the customer must read their last four to agents on the recorded line                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  Mr/Mrs XXX, SBIB, will AUTHENTICATE this debit order on your behalf. You will receive an SMS notifying you that a debit order has been setup on your bank account for this policy\r\nMr/Mrs XXX, you will receive an SMS from your bank notifying you that SBIB, has setup a debit order on your bank account. You MUST authenticate this debit order mandate for the premiums to be collected for this policy\r\nMr/Mrs XXX, to confirm that you have concluded an agreement with SBIB in respect of FLEXIBLE LIFE [insert] [policy] provided to you by the LIBERTY GROUP. Do you authorise SBIB to debit the [R [xxx amount payable] under the policy agreement from your bank account? If applicable, the first Collection Amount may include additional fees or charges. The Collection Amount may change depending on what is set out in the policy. This includes if there are any endorsements as set out in the Policy Schedule, annual increases in benefits and/or where you request changes to your policy. SBIB will debit the Collection Amount on xxxx_ day and thereafter on the xxxx_ day of every MONTHLY, or on another day when there is money in your Bank Account. The Collection Amount will carry a Statement Reference Number which is SBIB’s short name plus your policy number. This will be provided to you before the first Collection Date. This will help you to identify the Collection Amount on your bank statement. If the Collection Date falls on a non-processing day (Sunday or public holiday), you agree that the Collection Amount may be debited against the Bank Account on the first business day before/prior. If there is not enough money in your Bank Account on the Collection Date, SBIB may track the Bank Account (at no cost to you) and debit the Collection Amount on another day when there is money in your Bank Account. Where the debit of the Collection Amount is successful on more than two consecutive occasions on a date other than your selected date, your Collection Date may default to the successful date. If SBIB cannot debit the Collection Amount for any reason, you understand that your insurance cover may be impacted, and that you may pay for bank charges related to this Debit Order Mandate. The total amount that is collected under this Debit Order Mandate may not be more than the Maximum Payment amount. The annual adjustment rate will not be more than half the premium payment. The Collection Amount will continue to be debited from your Bank Account under this Debit Order Mandate until you cancel; or the Insurer cancels your Policy or until you cancel this Debit Order Mandate by giving us (SBIB) 30 days written notice. You understand that if you cancel the authority to debit your bank account, your insurance policy will be cancelled, and all benefits will cease. If the authentication is not received for some reason, then SBIB will attempt to electronically collect the premium to ensure you remain under cover. Do you confirm that you understand and agree to the terms of this Debit Order Mandate?",
        "category": "Debit Order Mandate",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "SBIB holds a binder agreement and therefore earns a binder fee of up to 7.50% from Liberty Group. Both the commission and binder fee already form part of the quoted premium",
        "category": "Binder Fee & Commission",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "You will be sent an obligatory disclosure and statutory notice which outlines important information as well as the terms and conditions which you will need to understand. You have an obligation to read this - please contact us should you not receive that within the next 31 \r\ndays. <Customer name>, please note that your policy documents will be sent to you via SMS – you will need to use the first 6 digits of your ID number to access the documents. Should you not receive this SMS within the next 31 days – please let us know and we will resend them to you.",
        "category": "Documentation",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "Please note that Liberty and their compliance officer can be contacted on 0860 456 789. SBIB supports the OMBUDSMAN for long term insurance as well as the FAIS Ombud and subscribes to the Standard Bank complaints procedure.\r\nDetails of that will also be included in the documentation along with contact details of SBIB and our compliance officer.Our compliance officer can be contacted at \r\nComplaint.ResolutionCentre@standardbank.co.za\r\nTelephone: 0860 101 101\r\nPlease also note that our Help Desk and Claims departments can be reached on 0860 123 999.\r\n",
        "category": "SBIB Contact Details",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "Your policy includes a cooling off period of 31 days. After the cooling off period, you must provide us with 31 days’ notice to cancel the policy. Cooling off applies to new policies or changes (excluding administrative changes), made to this policy",
        "category": "Cooling off period",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      }
    ],
    "FindingMarket": [
      {
        "phrase": "<Client name>, cover on this policy starts from a minimum of R50 000 up to a maximum of R500 000 and there are various options for you to choose from in R500 incremental benefit levels. What cover amount would you like me to quote you for? Cover amount confirmation: <Client name>, are you happy for us to proceed and arrange the (cover amount of RXX) life insurance for you? Customer must answer Yes to confirm the sum insured amount. If spouse cover wanted and is eligible: What cover amount would you like me to quote you for your spouse? Cover amount confirmation: <Client name>, are you happy for us to proceed and arrange the  (cover amount of RXX) life insurance for your spouse? Customer must answer Yes to confirm the sum insured amount",
        "category": "Cover Amount/Confirmation",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "The waiting period from the policy start date is 6 months (with 6 premiums needing to be paid) for natural causes of death before a claim will be paid. Accidental death is covered immediately upon receipt of your first premium.The policy does not cover any claims for suicide for the first 24 months. To qualify for the Premium Waiver benefit to be paid, the policy must have been active for 6 months, with at least 6 premiums being paid.",
        "category": "Waiting periods ",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "Claims are paid once all relevant documentation has been received and your claim has been approved. The documents required to claim are mentioned in the terms and conditions. You may claim at any Standard Bank branch or by contacting our claims contact center - 0860 123 999 (Option 3). Your claim must be submitted within 12 months from the date of death of the insured person.",
        "category": "Claims Process ",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "Accurate capturing of the information provided which includes personal details and product related information.",
        "category": "Accuracy Capturing Service Request on Core System",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "Never speak faster or slower than the client, always match their pace\r\nIf you are struggling to hear the customer let him know rather than trying to assume what he is saying. Remember it is important for the customer to hear and understand everything you are saying.",
        "category": "Pace of the call ",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      }
    ],
    "FindingProduct": [],
    "FindingProcess": [
      {
        "phrase": "Please confirm or add emails address ",
        "category": "Authentication",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "Country of Birth",
        "category": "Authentication",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "Country of Residency",
        "category": "Authentication",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "Country of Citizenship",
        "category": "Authentication",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "Country of issue ",
        "category": "Authentication",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "2.Spouse Life Assured must be available to answer the medical disclosure questions via telephone – or spouse cover cannot be issued",
        "category": "Business Process and work instructions",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "3.Up to 5 beneficiaries are allowed per policy     ",
        "category": "Business Process and work instructions",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "4. The customer does not need to have a Standard Bank account in order to take out this product",
        "category": "Business Process and work instructions",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      },
      {
        "phrase": "7.The spouse does not have to consent to POPI – as the policy is issued in the main insured’s name and by speaking to the spouse the spouse is being made aware that their spouse is taking out a policy for them.  Only the main insured can nominate beneficiaries, and the beneficiaries are sanction screened at claims stage. If the Spouse passes away – the benefit amount is paid to the main insured. The Spouses information if not processes or sanction screened on a daily basis.",
        "category": "Business Process and work instructions",
        "compliance": "No",
        "comment": "",
        "status": "Not Started",
        "Assigned": "NTSAKO"
      }
    ],
    "FindingCustomer": []
  }
]